#include <STC15F2K60S2.H>


//假定测试芯片的工作频率为11.0592MHz


#define FOSC 11059200L

#define T1MS (65536-FOSC/1000)      //1T模式
//#define T1MS (65536-FOSC/12/1000) //12T模式




//-----------------------------------------------
//中断服务程序
void t2int() interrupt 12           //中断入口
{
    P10 = !P10;                     //将测试口取反
}

//-----------------------------------------------

void main()
{
    AUXR |= 0x04;                   //定时器2为1T模式
//  AUXR &= ~0x04;                  //定时器2为12T模式
    T2L = T1MS;                     //初始化计时值
    T2H = T1MS >> 8;
    AUXR |= 0x10;                   //定时器2开始计时
    IE2 |= 0x04;                    //开定时器2中断
    EA = 1;

    while (1);
}
