#include"stc15fxxxx.h"							
sbit RS=P2^0;		//数据/命令寄存器选择控制端
sbit RW=P2^1;		//读写控制端
sbit E=P2^2;		//使能控制器
sfr LCD=0x80;		//P0作为总线端口
sbit BF=LCD^7;		//BF在P0.7上传输
 /********************************************
功能：延时函数
入口参数：
出口参数：无
*********************************************/

   void delay(int n)
   {
      int i;
	  for(i=0;i<n;i++);
   }
/********************************************
功能：向液晶屏写入命令
入口参数：cmd
出口参数：无
*********************************************/
void lcd_cmd(u8 cmd)
{
	LCD=cmd;
	RS=0;				//选择命令寄存器
	RW=0;				//执行写数据操作
	E=1;
	_nop_();
	E=0;
	delay(50);

}
/*************************************
功能：向液晶屏写入数据
入口参数：dat
出口参数：无
**************************************/
void lcd_dat(u8 dat)
{
	LCD=dat;			//显示数据送总线
	RS=1;
	RW=0;
	E=1;
	_nop_();
	E=0;				//使能信号有效
	_nop_();
	delay(50);

}
/*******************************************
液晶屏初始化
入口参数：无
出口参数：无
*********************************************/
void init_lcd(void)
{
	lcd_cmd(0x01);		// 清屏
	lcd_cmd(0x3c);		//设置双行
	lcd_cmd(0x0C);		//关闭光标
	lcd_cmd(0x80);		//显示在第一行
}







